# Визначення функції та констант
def f(x):
    return 1 / (1 + x ** 3)


# Визначення констант
a = 2  # Початкова точка інтегрування
epsilon = 0.005  # Точність
delta_b = 0.1  # Значення, на яке буде збільшуватись b на кожному кроці
b = a + delta_b  # Початкове значення b
n = 1000  # Кількість сегментів для методу трапецій

# Виконання методу трапецій та виведення проміжних результатів
integral_prev = 0  # Значення інтегралу на попередньому кроці
while True:
    h = (b - a) / n  # Обчислення кроку
    integral = 0.5 * (f(a) + f(b))  # Початкові значення для методу трапецій

    # Обчислення інтегралу методом трапецій
    for i in range(1, n):
        integral += f(a + i * h)
    integral *= h

    # Перевірка умови зупинки
    if abs(integral - integral_prev) < epsilon:
        break

    # Зберігання поточного значення інтегралу та збільшення b
    integral_prev = integral
    b += delta_b

print(integral, b)
